## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.wordpress_errors`          |
|        | `aws_cloudwatch_log_metric_filter.wordpress_warnings`        |
|        | `aws_cloudwatch_metric_alarm.wordpress_errors`               |
|        | `aws_cloudwatch_metric_alarm.wordpress_warnings`             |
| update | `aws_cloudwatch_metric_alarm.ecs_cpu_utilization`            |
|        | `aws_cloudwatch_metric_alarm.ecs_memory_utilization`         |
|        | `aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event` |
|        | `aws_cloudwatch_metric_alarm.wordpress_failed_login`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.wordpress_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "wordpress_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/wordpress"
      + name           = "WordPressErrors"
      + pattern        = "?Error ?error ?Fatal ?fatal ?Failed ?failed -\"slug=error\""

      + metric_transformation {
          + default_value = "0"
          + name          = "WordPressErrors"
          + namespace     = "WordPress"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.wordpress_warnings will be created
  + resource "aws_cloudwatch_log_metric_filter" "wordpress_warnings" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/wordpress"
      + name           = "WordPressWarnings"
      + pattern        = "?Warning ?warning"

      + metric_transformation {
          + default_value = "0"
          + name          = "WordPressWarnings"
          + namespace     = "WordPress"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.ecs_cpu_utilization will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ecs_cpu_utilization" {
        id                        = "ECSCpuUtilization"
        tags                      = {}
      ~ treat_missing_data        = "missing" -> "notBreaching"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ecs_memory_utilization will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ecs_memory_utilization" {
        id                        = "ECSMemoryUtilization"
        tags                      = {}
      ~ treat_missing_data        = "missing" -> "notBreaching"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "wordpress_ecs_warn_error_event" {
        id                        = "WordPressEcsWarnErrorEvent"
      ~ metric_name               = "WordPressEcsWarningEvent" -> "WordPressEcsWarnErrorEvent"
        tags                      = {}
      ~ treat_missing_data        = "missing" -> "notBreaching"
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.wordpress_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + alarm_description                     = "WordPress errors detected in a 1 minute period"
      + alarm_name                            = "WordPressErrors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WordPressErrors"
      + namespace                             = "WordPress"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.wordpress_failed_login will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "wordpress_failed_login" {
        id                        = "WordPressFailedLogin"
        tags                      = {}
      ~ treat_missing_data        = "missing" -> "notBreaching"
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.wordpress_warnings will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_warnings" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + alarm_description                     = "WordPress warnings detected in a 1 minute period"
      + alarm_name                            = "WordPressWarnings"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WordPressWarnings"
      + namespace                             = "WordPress"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:729164266357:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

Plan: 4 to add, 4 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_response_time_average"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_unhealthy_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_cpu_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_memory_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_aurora_replica_lag"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_failed_login"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_warnings"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch_us_east"]
WARN...
```

</details>
